{"head": ["What’s Trending in Aquatics?"], "author": ["Kaitlyn Clay"], "text": ["\n          ", "Keeping up with the Joneses, or the fear of socio-economic cultural inferiority, is something nearly everyone struggles with. The constant examination of what others have or what hot new item will be on the shelves in the coming year is easy to get caught up in.", "\n", "In the professional world, this concept is something that can set you apart in your industry, and constantly evaluating ", "trends", " is an important part of Jessica Boyd’s job as the aquatics program director for the ", "Weingart YMCA Aquatics and Wellness Center", ", a location of the YMCA of Metropolitan Los Angeles. ", "\n", "Boyd explained a trend she is seeing across the spectrum for aquatics in community recreation is using water as a source of therapy and healing. The Weingart YMCA has seen an increase of clients coming to use the facility after being referred by their physicians. ", "\n", "“We have recently seen an influx of people battling arthritis and joint pain coming in and using our pool for therapy,” said Boyd. “Doctors are also referring their patients who are overweight with knee and back pain to use our pool as a safe form of exercise. Just being in the water, even if it isn’t in an intense aerobics class, is extremely therapeutic to the body.”", "\n", "Boyd also noted a great thing about this for the aquatics ", "staff", " at the Weingart YMCA is that the main piece of equipment being used is just water. She explained most rehabilitation occurs from clients simply moving through the water, but that they do have some equipment to use — like weights or water bikes — if needed.", "\n", "“One of our goals for 2019 is to simply expand these offerings for people with chronic disabilities,” said Boyd. “We will focus a lot on our programming to cater to different needs for different clients.”", "\n", "The Weingart YMCA is also putting a heavy focus on reestablishing the new implementations or changes they made to the aquatics program in 2018. One area they had huge success from was their challenge offerings for aquatics.", "\n", "Boyd explained in 2018, the aquatics staff began implementing challenges throughout the year to the members. After doing research and evaluations, they learned members enjoyed competition or team-styled events. However, finding a window of time that worked best for these challenges, when most members were using the aquatics facility, was difficult. ", "\n", "Thus, their strategy for competition had to change, which forged the creation of its most successful competition: the 100-mile swim challenge. ", "\n", "“It was completely free, the members didn’t have to pay anything extra to participate, and it didn’t require any extra equipment on our part,” said Boyd. “All we needed was a piece of paper for people to write down how many laps they swam. We had them write how many laps they swam each day and at the end of the month our lifeguards would add up the number of total laps for each swimmer and divide that by 72, which gave us their mileage for the month. We challenged them to do 100 miles in a year on their own time. It got everyone very motivated and it was something we could do that didn’t cost anyone money, but still left people feeling extremely accomplished. We have already had questions on when the upcoming year’s challenge will start, and I have heard fun smack talk between members.”", "\n", "In terms of equipment trends that Boyd sees for future implementation at the Weingart YMCA, she said they are evaluating those based on need rather than anything that is hot or new on the scene. She explained they start by breaking down the age demographic of members and then inventory their ", "needs and wants", " to determine where they should allocate funds.", "\n", "“Most equipment we like to buy are things individual swimmers can use and then put back,” said Boyd. “Most members we have enjoy swimming on their own or are coming in for workouts or rehabilitation needs. We don’t need features or things like a diving board or a slide at our Y, even though that may be a trend. We need more things like weighted vests, swimmer parachutes, fins and water weights. Our team really tries to weigh the pros and cons of our needs versus what is trending before we make an impulse decision on a large purchase, just because other community recreation facilities are.”", "\n        "], "image": ["background-image:url(https://communityrecmag.com/wp-content/uploads/2019/03/CO-0319-Aquatics.jpg);"], "tags": ["aquatics", "aquatics programming", "aquatics trends", "feature", "March/April 2019", "member experience", "programming", "trends", "workouts"], "but-links": ["https://communityrecmag.com/category/aquatics/"], "buttons": ["Aquatics"], "date": ["March 14, 2019"], "image(ALL)": []}